# üõ†Ô∏è Step 0: Setup & Install
Run this to make sure all tools are ready.

In [ ]:
import sys
import subprocess

print(f"Notebook is using: {sys.executable}")
print("Installing packages directly to this kernel...")

# Ensure jupysql is installed (The modern SQL interface)
subprocess.check_call([sys.executable, "-m", "pip", "install", "pandas", "sqlalchemy", "pymysql", "jupysql", "numpy"])

print("\n‚úÖ SUCCESS! Packages installed. Now run the cell below.")

# üîå Step 1: Connect & Create Database
We will create a database called `walmart_db`.

In [ ]:
import pandas as pd
import numpy as np
import sqlalchemy
import random
from datetime import datetime, timedelta

# CREDENTIALS
username = 'python_user'
password = 'password'
host = '127.0.0.1'
port = '3306'
db_name = "walmart_db"

# 1. Create DB if not exists
root_conn = f"mysql+pymysql://{username}:{password}@{host}:{port}"
engine = sqlalchemy.create_engine(root_conn)
with engine.connect() as conn:
     conn.execute(sqlalchemy.text(f"CREATE DATABASE IF NOT EXISTS {db_name}"))

# 2. Connect to the DB
db_connection_str = f"mysql+pymysql://{username}:{password}@{host}:{port}/{db_name}"
db_engine = sqlalchemy.create_engine(db_connection_str)
print(f"‚úÖ Connected to '{db_name}'!")

# üåü Step 2: The Star Schema Generator
We are building a **Retail Data Warehouse** with 5 tables:
1.  **Fact Table**: `fact_sales` (The transactions)
2.  **Dimensions**: `dim_products`, `dim_stores`, `dim_customers`, `dim_date`

*(Run this cell to generate thousands of realistic rows)*

In [ ]:
# --- CONFIGURATION ---
NUM_PRODUCTS = 50
NUM_STORES = 10
NUM_CUSTOMERS = 200
NUM_TRANSACTIONS = 2000

# ==========================================
# 1. DIM_PRODUCTS
# ==========================================
categories = ['Electronics', 'Home & Garden', 'Clothing', 'Grocery', 'Toys']
products = []
for i in range(1, NUM_PRODUCTS + 1):
    cat = random.choice(categories)
    price = round(random.uniform(5.0, 500.0), 2)
    cost = round(price * random.uniform(0.4, 0.8), 2)
    products.append([i, f"Product {i}", cat, price, cost])

df_products = pd.DataFrame(products, columns=['product_id', 'product_name', 'category', 'price', 'cost'])
df_products.to_sql('dim_products', db_engine, if_exists='replace', index=False)
print("‚úÖ Table 'dim_products' created.")

# ==========================================
# 2. DIM_STORES
# ==========================================
cities = [('Austin', 'TX', 'South'), ('New York', 'NY', 'East'), 
          ('San Francisco', 'CA', 'West'), ('Chicago', 'IL', 'Midwest'),
          ('Miami', 'FL', 'South')]
stores = []
for i in range(1, NUM_STORES + 1):
    city, state, region = random.choice(cities)
    stores.append([i, f"Store {i} - {city}", city, state, region])

df_stores = pd.DataFrame(stores, columns=['store_id', 'store_name', 'city', 'state', 'region'])
df_stores.to_sql('dim_stores', db_engine, if_exists='replace', index=False)
print("‚úÖ Table 'dim_stores' created.")

# ==========================================
# 3. DIM_CUSTOMERS
# ==========================================
segments = ['Consumer', 'Corporate', 'Home Office']
customers = []
for i in range(1, NUM_CUSTOMERS + 1):
    customers.append([i, f"Customer {i}", random.choice(segments)])

df_customers = pd.DataFrame(customers, columns=['customer_id', 'customer_name', 'segment'])
df_customers.to_sql('dim_customers', db_engine, if_exists='replace', index=False)
print("‚úÖ Table 'dim_customers' created.")

# ==========================================
# 4. DIM_DATE
# ==========================================
start_date = datetime(2023, 1, 1)
date_list = [start_date + timedelta(days=x) for x in range(365)]
dates = []
for dt in date_list:
    date_key = int(dt.strftime('%Y%m%d'))
    quarter = (dt.month - 1) // 3 + 1
    dates.append([date_key, dt, dt.year, dt.month, f"Q{quarter}", dt.strftime('%A')])

df_date = pd.DataFrame(dates, columns=['date_key', 'date', 'year', 'month', 'quarter', 'day_name'])
df_date.to_sql('dim_date', db_engine, if_exists='replace', index=False)
print("‚úÖ Table 'dim_date' created.")

# ==========================================
# 5. FACT_SALES (The Big One)
# ==========================================
sales_data = []
product_ids = df_products['product_id'].tolist()
store_ids = df_stores['store_id'].tolist()
customer_ids = df_customers['customer_id'].tolist()
date_keys = df_date['date_key'].tolist()

for i in range(1, NUM_TRANSACTIONS + 1):
    pid = random.choice(product_ids)
    sid = random.choice(store_ids)
    cid = random.choice(customer_ids)
    dkey = random.choice(date_keys)
    
    # Get price from product (simulated lookup)
    base_price = df_products.loc[df_products['product_id'] == pid, 'price'].values[0]
    qty = random.randint(1, 5)
    total = round(base_price * qty, 2)
    
    sales_data.append([i, dkey, pid, sid, cid, qty, total])

df_sales = pd.DataFrame(sales_data, columns=['transaction_id', 'date_key', 'product_id', 'store_id', 'customer_id', 'quantity', 'total_amount'])
df_sales.to_sql('fact_sales', db_engine, if_exists='replace', index=False)
print(f"‚úÖ Table 'fact_sales' created with {NUM_TRANSACTIONS} rows.")

# üîé Step 3: Analyze with SQL
Now we use `jupysql` to run complex analytical queries on our Star Schema.

In [145]:
%load_ext sql
%sql mysql+pymysql://python_user:password@127.0.0.1:3306/walmart_db
print("‚úÖ Connected to walmart_db!")

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'mysql+pymysql://python_user:***@127.0.0.1:3306/walmart_db'

‚úÖ Connected to walmart_db!

In [146]:
%%sql
/* QUERY 1: Total Revenue by Product Category */
SELECT 
    p.category,
    COUNT(f.transaction_id) as total_sales,
    CONCAT('$', FORMAT(SUM(f.total_amount), 2)) as revenue
FROM fact_sales f
JOIN dim_products p ON f.product_id = p.product_id
GROUP BY p.category
ORDER BY SUM(f.total_amount) DESC;

Running query in 'mysql+pymysql://python_user:***@127.0.0.1:3306/walmart_db'

5 rows affected.

+---------------+-------------+-------------+
|    category   | total_sales |   revenue   |
+---------------+-------------+-------------+
|      Toys     |     451     | $438,319.34 |
|  Electronics  |     410     | $305,899.48 |
| Home & Garden |     450     | $269,530.97 |
|    Grocery    |     428     | $259,727.55 |
|    Clothing   |     261     | $182,932.34 |
+---------------+-------------+-------------+

In [147]:
%%sql
/* QUERY 2: Sales Performance by Region */
SELECT 
    s.region,
    s.city,
    SUM(f.total_amount) as revenue
FROM fact_sales f
JOIN dim_stores s ON f.store_id = s.store_id
GROUP BY s.region, s.city
ORDER BY revenue DESC;

Running query in 'mysql+pymysql://python_user:***@127.0.0.1:3306/walmart_db'

5 rows affected.

+---------+---------------+--------------------+
|  region |      city     |      revenue       |
+---------+---------------+--------------------+
| Midwest |    Chicago    | 617408.6100000007  |
|   West  | San Francisco | 299526.6199999999  |
|  South  |     Austin    |      273650.1      |
|   East  |    New York   |      135812.3      |
|  South  |     Miami     | 130012.04999999997 |
+---------+---------------+--------------------+

In [148]:
%%sql
WITH sales AS (
    SELECT
        d.year,
        d.month,
        SUM(f.total_amount) AS total_sales
    FROM fact_sales f
    JOIN dim_date d ON f.date_key = d.date_key
    GROUP BY d.year, d.month
    ORDER BY d.year, d.month
),
monthly_sales AS (
    SELECT
        year,
        month,
        total_sales,
        LAG(total_sales) OVER (ORDER BY year, month) AS prev_month_sales,
        LEAD(total_sales) OVER (ORDER BY year, month) AS next_month_sales
    FROM sales
),
trends AS (
SELECT
    year,
    month,
    total_sales,
    prev_month_sales,
    next_month_sales,
    CASE 
        WHEN total_sales > prev_month_sales THEN 'Growing'
        WHEN total_sales < prev_month_sales THEN 'Declining'
        ELSE 'Stable'
    END AS sales_trend
FROM monthly_sales
)
SELECT year, month, sales_trend FROM trends;

Running query in 'mysql+pymysql://python_user:***@127.0.0.1:3306/walmart_db'

12 rows affected.

+------+-------+-------------+
| year | month | sales_trend |
+------+-------+-------------+
| 2023 |   1   |    Stable   |
| 2023 |   2   |   Growing   |
| 2023 |   3   |   Growing   |
| 2023 |   4   |  Declining  |
| 2023 |   5   |   Growing   |
| 2023 |   6   |   Growing   |
| 2023 |   7   |   Growing   |
| 2023 |   8   |   Growing   |
| 2023 |   9   |  Declining  |
| 2023 |   10  |  Declining  |
+------+-------+-------------+
Truncated to displaylimit of 10.

In [149]:
%%sql
SELECT 
    p1.product_name AS product,
    p1.category,
    p1.price AS product_price,
    p2.product_name AS related_product,
    p2.price AS related_price
FROM dim_products p1
JOIN dim_products p2 
    ON p1.category = p2.category 
    AND p1.product_id < p2.product_id  -- Avoid duplicates and self-matching
WHERE p1.category = 'Electronics'
ORDER BY p1.product_name, p2.price DESC
LIMIT 20;

Running query in 'mysql+pymysql://python_user:***@127.0.0.1:3306/walmart_db'

20 rows affected.

+------------+-------------+---------------+-----------------+---------------+
|  product   |   category  | product_price | related_product | related_price |
+------------+-------------+---------------+-----------------+---------------+
| Product 14 | Electronics |     209.8     |    Product 26   |     452.59    |
| Product 14 | Electronics |     209.8     |    Product 23   |     414.26    |
| Product 14 | Electronics |     209.8     |    Product 44   |     357.36    |
| Product 14 | Electronics |     209.8     |    Product 15   |     286.11    |
| Product 14 | Electronics |     209.8     |    Product 42   |     192.87    |
| Product 14 | Electronics |     209.8     |    Product 29   |     190.71    |
| Product 14 | Electronics |     209.8     |    Product 34   |     159.1     |
| Product 14 | Electronics |     209.8     |    Product 21   |     68.58     |
| Product 14 | Electronics |     209.8     |    Product 25   |     54.57     |
| Product 15 | Electronics |     286.11    |    Product 26   |     452.59    |
+------------+-------------+---------------+-----------------+---------------+
Truncated to displaylimit of 10.

In [150]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Chicago', 'Boston', 'Seattle']
}

In [151]:
df = pd.DataFrame(data)

In [152]:
print(df.iloc[1:3])

      Name  Age     City
1      Bob   30  Chicago
2  Charlie   35   Boston

In [153]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Chicago', 'Boston', 'Seattle'],
    'Salary': [50000.5, 60000.0, 75000.75, 80000.25],
    'Employed': [True, False, True, True],
    'Date': ['2025-03-18', '2025-03-19','2025-03-20','2025-03-21']
    
}
df=pd.DataFrame(data)

In [154]:
print(df.iloc[:, [0, 2]])

      Name      City
0    Alice  New York
1      Bob   Chicago
2  Charlie    Boston
3    David   Seattle

In [155]:
print(df[df["City"] .isin (["Boston", "Chicago"])])

      Name  Age     City    Salary  Employed        Date
1      Bob   30  Chicago  60000.00     False  2025-03-19
2  Charlie   35   Boston  75000.75      True  2025-03-20

In [156]:
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

In [157]:
print(df.loc['c'])

Name           Charlie
Age                 35
City            Boston
Salary        75000.75
Employed          True
Date        2025-03-20
Name: c, dtype: object

In [158]:
print(df.iloc[1:3])

      Name  Age     City    Salary  Employed        Date
b      Bob   30  Chicago  60000.00     False  2025-03-19
c  Charlie   35   Boston  75000.75      True  2025-03-20

In [159]:
print(df.loc[df['Age'] > 30])

      Name  Age     City    Salary  Employed        Date
c  Charlie   35   Boston  75000.75      True  2025-03-20
d    David   40  Seattle  80000.25      True  2025-03-21

In [160]:
print(df.iloc[:, :2])

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35
d    David   40

In [161]:
df.iloc[1, 1] = 32

In [162]:
print(df)

      Name  Age      City    Salary  Employed        Date
a    Alice   25  New York  50000.50      True  2025-03-18
b      Bob   32   Chicago  60000.00     False  2025-03-19
c  Charlie   35    Boston  75000.75      True  2025-03-20
d    David   40   Seattle  80000.25      True  2025-03-21

In [163]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Chicago', 'Boston', 'Seattle'],
    'Salary': [50000.5, 60000.0, 75000.75, 80000.25],
    'Employed': [True, False, True, True],
    'Date': ['2025-03-18', '2025-03-19','2025-03-20','2025-03-21']
    
}
df=pd.DataFrame(data)

In [164]:
numeric_cols = df.select_dtypes(include=['int64','float64'])

In [165]:
print(numeric_cols)

   Age    Salary
0   25  50000.50
1   30  60000.00
2   35  75000.75
3   40  80000.25

In [166]:
df['Age'] = df['Age'].astype('float64')

In [167]:
df = pd.read_csv("data.csv")
print(df[['Salary', 'City']].groupby('City').sum())

            Salary
City
Boston    75000.75
Chicago   60000.00
New York  50000.50
Seattle   80000.25

In [168]:
df = pd.read_csv("data.csv")
df['Salary'] = df['Salary'].astype('float64')
print(df)
print('Original Types:\n', df.dtypes)

print(df.iloc[1:3])
print(df.head(2))
print(df.iloc[[0, 2]])

      Name  Age      City    Salary  Employed
0    Alice   25  New York  50000.50      True
1      Bob   30   Chicago  60000.00     False
2  Charlie   35    Boston  75000.75      True
3    David   40   Seattle  80000.25      True
Original Types:
 Name         object
Age           int64
City         object
Salary      float64
Employed       bool
dtype: object
      Name  Age     City    Salary  Employed
1      Bob   30  Chicago  60000.00     False
2  Charlie   35   Boston  75000.75      True
    Name  Age      City   Salary  Employed
0  Alice   25  New York  50000.5      True
1    Bob   30   Chicago  60000.0     False
      Name  Age      City    Salary  Employed
0    Alice   25  New York  50000.50      True
2  Charlie   35    Boston  75000.75      True

In [169]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, None, 35, 40],
    'City': ['New York', 'Chicago', None, 'Seattle'],
    'Salary': [50000.5, 60000.0, None, 80000.25]
}

df = pd.DataFrame(data)

print(df.isna())

    Name    Age   City  Salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True    True
3  False  False  False   False

In [170]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Emma'],
    'Age': [25, None, 35, 40, None],
    'City': ['New York', 'Chicago', None, 'Seattle', None],
    'Salary': [50000.5, 60000.0, None, 80000.25,None],
    'Employed': [True, False, True, True, False]
}
df = pd.DataFrame(data)
# df_filled = df.fillna(0)
print(df.isnull().sum())
df_cleaned = df.dropna()
print(df_cleaned)

Name        0
Age         2
City        2
Salary      2
Employed    0
dtype: int64
    Name   Age      City    Salary  Employed
0  Alice  25.0  New York  50000.50      True
3  David  40.0   Seattle  80000.25      True

In [204]:
data = {
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard'],
    'Category': ['Electronics', 'Electronics', 'Electronics', 'Electronics', 'Accessories'],
    'Price': [1000.5, 500.75, 300.25, 150.99, 50.49],
    'Quantity': [5, 10, 15, 7, 20]
}
df = pd.DataFrame(data)
print(df)
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 2)
pd.set_option('display.float_format', '{:.2f}'.format)
pd.set_option('display.max_colwidth', 3)
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')
pd.reset_option('display.float_format')
pd.reset_option('display.max_colwidth')
print(df)

    Product  ... Quantity
0  Laptop    ...   5
1  Phone     ...  10
2  Tablet    ...  15
3  Monitor   ...   7
4  Keyboard  ...  20

[5 rows x 4 columns]
    Product     Category    Price  Quantity
0    Laptop  Electronics  1000.50         5
1     Phone  Electronics   500.75        10
2    Tablet  Electronics   300.25        15
3   Monitor  Electronics   150.99         7
4  Keyboard  Accessories    50.49        20

In [ ]:
data = {
    'Country': ['USA', 'USA', 'India', 'India', 'Canada', 'Canada'],
    'City': ['New York', 'Chicago', 'Mumbai', 'Delhi', 'Toronto', 'Vancouver'],
    'Population': [8500000, 2700000, 20000000, 18000000, 2900000, 2500000],
    'Area': [789, 589, 603, 1484, 630, 1150]  # in square kilometers
}

df = pd.DataFrame(data)
print(df)

df.set_index(['Country', 'City'], inplace=True)
print(df)

# print('Population of Mumbai:')
# print('Population', df.loc[('India', 'Mumbai'), 'Population'])
# print('Area',df.loc[('India', 'Mumbai'), 'Area'])
# print('Name:', df.loc[('India', 'Mumbai'), 'Population'] / df.loc[('India', 'Mumbai'), 'Area'])
df.rese
print("\nPopulation of Mumbai:")
print(df.loc[('India', 'Mumbai')])

  Country       City  Population  Area
0     USA   New York     8500000   789
1     USA    Chicago     2700000   589
2   India     Mumbai    20000000   603
3   India      Delhi    18000000  1484
4  Canada    Toronto     2900000   630
5  Canada  Vancouver     2500000  1150
                   Population  Area
Country City
USA     New York      8500000   789
        Chicago       2700000   589
India   Mumbai       20000000   603
        Delhi        18000000  1484
Canada  Toronto       2900000   630
        Vancouver     2500000  1150

Population of Mumbai:
Population    20000000
Area               603
Name: (India, Mumbai), dtype: int64

In [3]:
data = {
    'Student': ['John', 'Anna', 'Mike', 'Sara', 'Tom'],
    'Marks': [85, 78, 92, 65, 88],
    'Grade': ['A', 'B', 'A', 'C', 'A'],
    'Subject': ['Math', 'Science', 'English', 'Math', 'History']
}

# Display the Original DataFrame
# Select all students with Marks > 80 and print Results.
# Select all students who have Grade equal to 'A' and print Results..
# Select students with Marks between 50 and 90 and print Results..
# Select all students where the Subject contains 'Math' and print Results..

df = pd.DataFrame(data)
print('Original DataFrame:')
print(df)

print('Students with Marks greater than 80:')
print(df[df['Marks'] > 80])

print("Students with Grade equal to 'A':")
print(df[df['Grade'] == 'A'])

print("Students with Marks between 50 and 90:")
print(df[(df['Marks'] >= 50) & (df['Marks'] <= 90)])

print("Students where Subject contains 'Math':")
print(df[df['Subject'].str.contains('Math')])

NameError: name 'pd' is not defined

In [5]:
import pandas as pd

# Step 1: Create DataFrame
data = {
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard'],
    'Price': [1000, 500, 300, 150, 50],
    'Stock': [10, 50, 30, 5, 100],
    'Category': ['Electronics', 'Electronics', 'Electronics', 'Electronics', 'Accessories']
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Step 2: Add a new column 'Discounted_Price' (10% discount using apply)
df['Discounted_Price'] = df['Price'].apply(lambda x: x * 0.90)

print("\nDataFrame after adding Discounted_Price:")
print(df)

# Step 3: Create 'Price_Str' column using map()
df['Price_Str'] = df['Price'].map(lambda x: f"${x}")

print("\nDataFrame after adding Price_Str:")
print(df)

# Step 4: Convert all numeric values in 'Price' and 'Stock' to strings using applymap()
df[['Price', 'Stock']] = df[['Price', 'Stock']].applymap(str)

print("\nDataFrame after converting numeric values to strings:")
print(df)

# Step 5: Create a custom function using apply() to calculate 'Stock_Value'
def calculate_stock_value(row):
    return float(row['Price']) * float(row['Stock'])

df['Stock_Value'] = df.apply(calculate_stock_value, axis=1)

print("\nDataFrame after adding Stock_Value:")
print(df)

Original DataFrame:
    Product  Price  Stock     Category
0    Laptop   1000     10  Electronics
1     Phone    500     50  Electronics
2    Tablet    300     30  Electronics
3   Monitor    150      5  Electronics
4  Keyboard     50    100  Accessories

DataFrame after adding Discounted_Price:
    Product  Price  Stock     Category  Discounted_Price
0    Laptop   1000     10  Electronics             900.0
1     Phone    500     50  Electronics             450.0
2    Tablet    300     30  Electronics             270.0
3   Monitor    150      5  Electronics             135.0
4  Keyboard     50    100  Accessories              45.0

DataFrame after adding Price_Str:
    Product  Price  Stock     Category  Discounted_Price Price_Str
0    Laptop   1000     10  Electronics             900.0     $1000
1     Phone    500     50  Electronics             450.0      $500
2    Tablet    300     30  Electronics             270.0      $300
3   Monitor    150      5  Electronics             135.0      $150
4  Keyboard     50    100  Accessories              45.0       $50

DataFrame after converting numeric values to strings:
    Product Price Stock     Category  Discounted_Price Price_Str
0    Laptop  1000    10  Electronics             900.0     $1000
1     Phone   500    50  Electronics             450.0      $500
2    Tablet   300    30  Electronics             270.0      $300
3   Monitor   150     5  Electronics             135.0      $150
4  Keyboard    50   100  Accessories              45.0       $50

DataFrame after adding Stock_Value:
    Product Price Stock     Category  Discounted_Price Price_Str  Stock_Value
0    Laptop  1000    10  Electronics             900.0     $1000      10000.0
1     Phone   500    50  Electronics             450.0      $500      25000.0
2    Tablet   300    30  Electronics             270.0      $300       9000.0
3   Monitor   150     5  Electronics             135.0      $150        750.0
4  Keyboard    50   100  Accessories              45.0       $50       5000.0

C:\Users\ksank\AppData\Local\Temp\ipykernel_23344\4202195360.py:29: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[['Price', 'Stock']] = df[['Price', 'Stock']].applymap(str)

In [7]:
import pandas as pd

In [6]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=['A','B','C'], index=['x','y','z','w'])

NameError: name 'pd' is not defined

In [8]:
coffee = pd.read_csv("coffee.csv")

In [9]:
olympics_data = pd.read_excel('olympics-data.xlsx')

In [10]:
results = pd.read_parquet('results.parquet')

In [14]:
olympics_data.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Fran√ßois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyr√©n√©es-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [15]:
results = pd.read_parquet('results.parquet')
bios = pd.read_csv('bios.csv')

In [38]:
coffee.index = coffee["Day"]

In [52]:
coffee.loc[1:3, "Units Sold"] = 10

In [ ]:
coffee.head()

In [ ]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0,1])

In [ ]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("\n\n\n\n\n")

In [16]:
bios[bios['name'].str.contains("Keith|patrick", case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [ ]:
bios[bios['born_country'].isin(['USA', 'FRA', 'GBR']) & 
    (bios['name'].str.startswith('Keith'))
]

In [ ]:
bios.query('born_country == "USA" and born_city == "Seattle"')

In [39]:
coffee['price'] = 4.99

In [44]:
import numpy as np
coffee['new_price'] = np.where(coffee['Coffee Type']=='Espresso', 3.99, 5.99)

In [41]:
coffee.drop(columns=['price'], inplace=True)
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          50       3.99
11   Saturday       Latte          40       5.99
12     Sunday    Espresso          55       3.99
13     Sunday       Latte          45       5.99

In [35]:
coffee_new = pd.read_csv('coffee.csv')

In [ ]:
coffee_new

In [53]:
# coffee = coffee[['Day', 'Coffee Type', 'Units Sold', 'new_price']]
coffee.head()

         Day Coffee Type  Units Sold  new_price
0     Monday    Espresso          25       3.99
1     Monday       Latte          15       5.99
2    Tuesday    Espresso          30       3.99
3    Tuesday       Latte          20       5.99
4  Wednesday    Espresso          35       3.99

In [54]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

In [ ]:
coffee.head()

In [ ]:
coffee.rename(columns={'new_price':'price'})

In [66]:
import pandas as pd
import matplotlib.pyplot as plt

data = {
    'Date': pd.date_range(start='2025-02-01', periods=12, freq='D'),
    'Sales': [120, 150, 180, 210, 250, 300, 280, 270, 260, 310, 320, 330]
}
df = pd.DataFrame(data)

df.set_index('Date', inplace=True)

print(df)

            Sales
Date
2025-02-01    120
2025-02-02    150
2025-02-03    180
2025-02-04    210
2025-02-05    250
2025-02-06    300
2025-02-07    280
2025-02-08    270
2025-02-09    260
2025-02-10    310
2025-02-11    320
2025-02-12    330

In [ ]:
df['Rolling_Avg']=df['Sales'].rolling(window=3).sum()
print("Dataframe with rolling average")
# print(df.head())

df['EMA']=df['Sales'].ewm(span=3,adjust=False).mean()
print(plt.plot(df['Sales'],label='Sales'))
print(plt.plot(df['Rolling_Avg'],label='Rolling Average'))
print(plt.plot(df['EMA'],label='EMA'))
# print("Dataframe with EMA")
# print(df.head())
plt.legend()
plt.show()

In [ ]:
df['sales_lagged_1']=df['Sales'].shift(periods=1)
df['Sales_Leading_1']=df['Sales'].shift(periods=-1)

print(df.head())
df['Percent_Change']=(df['Sales'].pct_change()*100).round(2)
print(df.head())

In [ ]:
import pandas as pd
data = { 'Name': ['John', 'Jane', 'Bob', 'Alice', 'Mike', 'Sara','Mark','Eric','John','Jane','Bob','Alice','Mike','Sara','Mark','Eric'],
        'Age': [28, 22, 34, 42, 19, 31, 67,28, 22, 34, 42, 19, 31, 67,28, 22],
        'City': ['New York','New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia','San Francisco','New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia','San Francisco','San Francisco']

}
df = pd.DataFrame(data)

print(df)

In [ ]:
pd.cut(df['Age'], bins=4)

In [ ]:
df['Age Group']= pd.cut(df['Age'], bins=3)
df

In [ ]:
bins = [0, 18, 35, 50, 100]
labels = ['Child', 'Young Adult', 'Middle Aged', 'Senior+']
df['Age_Group'] = pd.cut(df['Age'], bins=bins, labels=labels)

print(df)

In [ ]:
import pandas as pd

data = { 
    'article_id': [1, 2, 3, 4, 5],
    'title': ['Article 1', 'Article 2', 'Article 3', 'Article 4', 'Article 5'],
    'tags': [['python', 'data analysis', 'machine learning', 'AI',],
             ['python', 'data visualization'],
             ['data science', 'statistics'],
             ['python', 'data analysis', 'machine learning', 'AI',],
             ['python', 'data analysis', 'Magic', 'Adobe',]]

}
df = pd.DataFrame(data)
df

In [ ]:
df.explode('tags')

In [ ]:
data = {
    'order_id': [101, 102, 103],
    'products': [['laptop', 'tablet'], ['phone', 'headphones'], ['watch', 'charger']],
    'features': [['lightweight', 'high performance'], ['5G','camera'], ['gaming','touch screen']]
}
df = pd.DataFrame(data)

In [ ]:
df.explode(['products','features'])

In [ ]:
df.explode(['products','features'], ignore_index=True)

In [50]:
df = pd.DataFrame({'Sales': [1200, 2500, 4000, 5700, 8600],
                   'Region Code': [13, 23, 18, 33, 48],
                   'Personnel': [12, 25, 37, 44, 63]
},
)
df

   Sales  Region Code  Personnel
0   1200           13         12
1   2500           23         25
2   4000           18         37
3   5700           33         44
4   8600           48         63

In [46]:
df.shift(periods=3)

    Sales  Region Code  Personnel
0     NaN          NaN        NaN
1     NaN          NaN        NaN
2     NaN          NaN        NaN
3  1200.0         13.0       12.0
4  2500.0         23.0       25.0

In [38]:
df.shift(periods=1, axis='columns')

   Sales  Region Code  Personnel
0    NaN         1200         13
1    NaN         2500         23
2    NaN         4000         18
3    NaN         5700         33
4    NaN         8600         48

In [47]:
df.shift(periods=3, fill_value=0)

   Sales  Region Code  Personnel
0      0            0          0
1      0            0          0
2      0            0          0
3   1200           13         12
4   2500           23         25

In [48]:
df[['Region Code', 'Personnel']] = df[['Region Code', 'Personnel']].shift(3)

In [51]:
df

   Sales  Region Code  Personnel
0   1200           13         12
1   2500           23         25
2   4000           18         37
3   5700           33         44
4   8600           48         63

In [ ]:
df.shift(-2)

In [71]:
data = {
    'first_name': ['John', 'Jane', 'Bob', 'Alice', 'Mike'],
    'last_name': ['Doe', 'Doe', 'Smith', 'Johnson', 'Williams'],
    'score': [88, 92, 30, 60, 21]
}

df = pd.DataFrame(data)

print(df)

  first_name last_name  score
0       John       Doe     88
1       Jane       Doe     92
2        Bob     Smith     30
3      Alice   Johnson     60
4       Mike  Williams     21

In [72]:
def get_results(score):
    if score >= 35:
        return 'Pass'
    else:
        return 'Fail'  

df['result'] = df['score'].apply(get_results)

In [73]:
print(df)

  first_name last_name  score result
0       John       Doe     88   Pass
1       Jane       Doe     92   Pass
2        Bob     Smith     30   Fail
3      Alice   Johnson     60   Pass
4       Mike  Williams     21   Fail

In [57]:
df['score_squared'] = df['score'].apply(lambda x: x**2)

In [ ]:
print(df)

In [ ]:
df['full_name'] = df.apply(lambda row: f"{row['first_name']} {row['last_name']}", axis=1)
# df['full name'] = df['first_name'] + ' ' + df['last_name']

print(df)

In [77]:
df = pd.DataFrame({
    'Student': ['Alice', 'Bob', 'Charlie'],
    'Math': [92, 85, 78],
    'Science': [88, 95, 76],
    'English': [82, 79, 91],
    "History": [75, 80, 85]

})
print(df)

   Student  Math  Science  English  History
0    Alice    92       88       82       75
1      Bob    85       95       79       80
2  Charlie    78       76       91       85

In [ ]:

melted_df = pd.melt(
    df,
    id_vars="Student",
    value_vars=["Math", "Science", "English", "History"],
    var_name="Subject",
    value_name="Score"  
)
print(melted_df)

In [ ]:
data = {
    'Month':['Jan','Jan','Feb','Feb','Mar','Mar','Apr','Apr','May','May','Jun','Jun'],
    'Product':['Apple','Orange','Apple','Orange','Apple','Orange','Apple','Orange','Apple','Orange','Apple','Orange'],
    'Sales': [120, 150, 180, 210, 250, 300, 280, 270, 260, 310, 320, 330]
}

df = pd.DataFrame(data)
# df.set_index('Month', inplace=True)
print(df)

In [88]:
pivot_df = df.pivot(index='Month', columns='Product', values='Sales')
print(pivot_df)

Product  Apple  Orange
Month
Apr        280     270
Feb        180     210
Jan        120     150
Jun        320     330
Mar        250     300
May        260     310

NameError: name 'pd' is not defined